app/controllers/profiles_controller.rb

  def index
    @profiles = Profile.all
---
SELECT "profiles".* FROM "profiles"

  def create
    @profile = Profile.new(profile_params)
    @profile.user_id = current_user.id
    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("created_at", "updated_at", "user_id", "name", "profile_image", "contact") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "profile_image" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["profile_image", "#<ActionDispatch::Http::UploadedFile:0x00007fa2de822d18>"], ["updated_at", "2019-12-27 10:30:22.936778"], ["id", 1]]

  def destroy
    @profile.destroy
---
DELETE FROM "profiles" WHERE "profiles"."id" = $1  [["id", 1]]

    def set_profile
      @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]